{
  "@type" : "TEMPLATE",
  "uid" : "a5b76e20-57ff-400c-a59a-ea62f081e873",
  "description" : {
    "@type" : "RESOURCE_DESCRIPTION",
    "originalAuthor" : {
      "date" : "2023-09-06"
    },
    "otherContributors" : [ ],
    "lifecycleState" : {
      "codeString" : "unmanaged"
    },
    "ipAcknowledgements" : { },
    "references" : { },
    "conversionDetails" : { },
    "otherDetails" : {
      "licence" : "",
      "custodian_organisation" : "",
      "original_namespace" : "",
      "original_publisher" : "",
      "custodian_namespace" : "",
      "sem_ver" : "1.0.0-alpha.2",
      "build_uid" : "fceaf017-2a21-4c08-aad8-81c007afff81",
      "MD5-CAM-1.0.1" : "0b927287e532f315a61ea68b543c939e",
      "PARENT:MD5-CAM-1.0.1" : "B8AD0C7EB492491CE6F7968C1AFFB40C"
    },
    "details" : {
      "de" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "de"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "sv" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "sv"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "nb" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "nb"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "ar-sy" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "ar-sy"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "en" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "en"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      },
      "nl" : {
        "@type" : "RESOURCE_DESCRIPTION_ITEM",
        "language" : {
          "terminologyId" : {
            "value" : "ISO_639-1"
          },
          "codeString" : "nl"
        },
        "keywords" : [ ],
        "originalResourceUri" : { },
        "otherDetails" : { }
      }
    }
  },
  "parentArchetypeId" : "openEHR-EHR-COMPOSITION.request.v1",
  "differential" : true,
  "archetypeId" : {
    "@type" : "ARCHETYPE_HRID",
    "value" : "openEHR-EHR-COMPOSITION.t_request.v1"
  },
  "definition" : {
    "@type" : "C_COMPLEX_OBJECT",
    "rmTypeName" : "COMPOSITION",
    "nodeId" : "at0000.1",
    "attributes" : [ {
      "@type" : "C_ATTRIBUTE",
      "rmAttributeName" : "context",
      "children" : [ {
        "@type" : "C_COMPLEX_OBJECT",
        "rmTypeName" : "EVENT_CONTEXT",
        "attributes" : [ {
          "@type" : "C_ATTRIBUTE",
          "rmAttributeName" : "other_context",
          "children" : [ {
            "@type" : "C_COMPLEX_OBJECT",
            "rmTypeName" : "ITEM_TREE",
            "nodeId" : "at0001",
            "attributes" : [ {
              "@type" : "C_ATTRIBUTE",
              "rmAttributeName" : "items",
              "children" : [ {
                "@type" : "C_ARCHETYPE_ROOT",
                "rmTypeName" : "CLUSTER",
                "occurrences" : "0..1",
                "nodeId" : "at0042.1",
                "attributes" : [ ],
                "attributeTuples" : [ ],
                "archetypeRef" : "Care unit v1",
                "referenceType" : "templateId"
              } ]
            } ],
            "attributeTuples" : [ ]
          } ]
        } ],
        "attributeTuples" : [ ]
      } ]
    }, {
      "@type" : "C_ATTRIBUTE",
      "rmAttributeName" : "content",
      "existence" : "0..1",
      "cardinality" : {
        "@type" : "CARDINALITY",
        "interval" : "1..*",
        "ordered" : false,
        "unique" : false
      },
      "children" : [ {
        "@type" : "C_ARCHETYPE_ROOT",
        "rmTypeName" : "ACTION",
        "occurrences" : "0..1",
        "nodeId" : "at0.6",
        "attributes" : [ ],
        "attributeTuples" : [ ],
        "archetypeRef" : "openEHR-EHR-ACTION.ovl-service-001.v1",
        "referenceType" : "archetypeOverlay"
      }, {
        "@type" : "C_ARCHETYPE_ROOT",
        "rmTypeName" : "INSTRUCTION",
        "occurrences" : "0..1",
        "nodeId" : "at0.8",
        "attributes" : [ ],
        "attributeTuples" : [ ],
        "archetypeRef" : "openEHR-EHR-INSTRUCTION.ovl-service_request-001.v1",
        "referenceType" : "archetypeOverlay"
      } ]
    } ],
    "attributeTuples" : [ ]
  },
  "terminology" : {
    "@type" : "ARCHETYPE_TERMINOLOGY",
    "conceptCode" : "at0000",
    "termDefinitions" : {
      "en" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "POC BoS Remiss molekylärpatologi",
          "description" : "Document sent from one treating healthcare provider or organisation to another, for the purpose of requesting advice, a service or transfer of care."
        }
      },
      "ar-sy" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "POC BoS Remiss",
          "description" : "*Document sent from one treating healthcare provider or organisation to another, for the purpose of requesting advice, a service or transfer of care.(en)"
        }
      },
      "nb" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "POC BoS Remiss",
          "description" : "Dokument som sendes fra en helsetjenesteyter til en annen, med hensikt om å forespørre om råd, en tjeneste eller overføring av ansvar."
        }
      },
      "nl" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "POC BoS Remiss",
          "description" : "Document verstuurd van de ene behandelende zorgaanbieder of organisatie naar een andere, met als doel het vragen van advies, een dienst of overdracht van zorg."
        }
      },
      "sv" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "POC BoS Remiss",
          "description" : "Dokument som skickas från en vårdgivare eller organisation till en annan, i syfte att be om råd, begära en tjänst eller att begära vårdöverföring."
        }
      },
      "de" : {
        "at0000.1" : {
          "@type" : "ARCHETYPE_TERM",
          "code" : "at0000.1",
          "text" : "POC BoS Remiss",
          "description" : "Das Dokument, das von einem behandelnden Gesundheitsdienstleister oder einer behandelnden Organisation an einen anderen gesendet wird, um Beratung, eine Dienstleistung oder Übertragung der Versorgung anzufordern."
        }
      }
    },
    "termBindings" : { },
    "terminologyExtracts" : { },
    "valueSets" : { }
  },
  "adlVersion" : "1.4",
  "buildUid" : "c2877fa3-8071-346b-8d34-6b9da3fe5286",
  "rmName" : "openehr",
  "rmRelease" : "1.1.0",
  "generated" : true,
  "templateId" : "POC BoS Remiss molekylärpatologi",
  "otherMetaData" : { },
  "templateOverlays" : [ {
    "@type" : "TEMPLATE_OVERLAY",
    "uid" : "50d8b4db-579b-4b4b-8ff2-50e8ca57fb2a",
    "description" : {
      "@type" : "RESOURCE_DESCRIPTION",
      "originalAuthor" : { },
      "otherContributors" : [ ],
      "ipAcknowledgements" : { },
      "references" : { },
      "conversionDetails" : { },
      "otherDetails" : {
        "PARENT:MD5-CAM-1.0.1" : "4b5afa094e5085b606a94f8ba90d4d09"
      },
      "details" : {
        "de" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "de"
          },
          "purpose" : "Um Details über eine einfache, gesundheitsbezogene Dienstleistung oder Aktivität, die von einem Kliniker, einer Organisation oder einer Behörde erbracht wird, darzustellen.",
          "keywords" : [ "Überweisung", "Besuch", "Kontakt", "Leistung" ],
          "use" : "Zur Darstellung einer gesundheitsbezogener Dienstleistung oder Aktivität, die von einem Kliniker, einer Organisation oder einer Behörde bereitgestellt wird. Dies beinhaltet das Verfolgen des Fortschritts von der Planung über die Terminierung und Lieferung bis zur Fertigstellung sowie Abweichungen vom beabsichtigten Behandlungspfad wie Verschiebung oder Stornierung. Dies wird durch die Aufzeichnung relevanter Datenelemente zu bestimmten Aktivitäten erreicht, von denen jede als \"Pathway\"-Prozessschritte in diesem Archetyp beschrieben wird.\r\n\r\nDer Umfang dieses Archetyps umfasst bewusst Aktivitäten für eine breite Palette klinischer Dienstleistungen, um als nicht spezifisches Archetyp für alle Anwendungsfälle zu dienen. Beispiele hierfür sind unter anderem:\r\n- der selbstorganisierte Besuch eines Patienten zu einem vorsorglichen Check-Up bei einem Zahnarzt\r\n- eine Reihe von Besuchen zu einem Physiotherapeuten zur Behandlung einer muskuloskelettalen Belastung\r\n- die Überweisung einen anfordernden Gesundheitsdienstleister, wie zum Beispiel eines Hausarztes, an einen aufnehmenden Gesundheitsdienstleister, wie zum Beispiel einem Facharzt damit der Patient eine bestimmte Dienstleistung, Beratung oder Pflege erhält.\r\n\r\nZusätzliche strukturierte und ausführliche Informationen über diese Dienstleistung können, unter Verwendung eines spezifischen Archetyps der in den SLOT \"Dienstleistungsdetails\" integriert wird, dokumentiert werden.\r\n\r\nDieser Archetyp kann auf zwei Arten verwendet werden:\r\n- als vollständige Darstellung der erbrachten Dienstleistung, oder\r\n- als Rahmen um vorrangig den Status der angeforderten Leistung und separaten OBSERVATION-Archetypen um die eigentlichen Testergebnisse für die erbrachte Dienstleistung darzustellen. Zum Beispiel mit dem Archetyp OBSERVATION.hearing_screening_result.\r\n\r\nDie Zeitplanung im Zusammenhang mit einer Dienstleistung kann auf eine von zwei Arten verwaltet werden:\r\n- durch die Verwendung des Referenzmodells - die Zeit für die Ausführung eines Schritts im Prozess wird das Zeitattribut des ACTION-Archetyps für jeden Schritt verwendet.\r\n- durch die Verwendung von Archetyp-Datenelemente - das Datenfeld \"Geplantes Datum/geplante Uhrzeit\" ist dafür gedacht einen Zeitpunkt aufzuzeichnen, zu der die Dienstleistung durchgeführt werden sollte. Hinweis: Das zugehörige ACTION-Zeitattribut für den geplanten Prozessschritt wird die Zeit aufzeichnen, zu der die klinische Aktivität in ein System eingeplant wurde, nicht das beabsichtigte Datum/die beabsichtigte Uhrzeit, an dem die Aktivität durchgeführt werden soll.\r\n\r\nIn der Praxis werden einige Dienstleistungen (zum Beispiel in der ambulanten Versorgung) einmalig erbracht und nicht im Voraus bestellt. Die Details zu dieser Dienstleistung werden gegen den Schritt im Pfad \"Dienstleistung abgeschlossen\" hinzugefügt. In einigen Fällen wird eine wiederkehrende Dienstleistung bestellt, und in diesem Fall werden bei jeder Gelegenheit Daten unter dem Schritt \"Dienstleistung erbracht\" erfasst, wobei die Anweisung im aktiven Zustand bleibt. Wenn die letzte Erbringung der Dienstleistung erfasst wird, wird die Aktion \"Dienstleistung abgeschlossen\" aufgezeichnet, um anzuzeigen, dass diese Anforderung nun im abgeschlossenen Zustand ist.\r\n\r\nIn anderen Situationen, wie der sekundären Versorgung, gibt es möglicherweise eine formelle Anforderung einer Dienstleistung die dem Archetyp INSTRUCTION.request entspricht. Dieser ACTION-Archetyp kann dann verwendet werden um den Arbeitsablauf und die Durchführung der Anforderung zu beschreiben.\r\n\r\nDie Darstellung von Informationen mit Hilfe dieses ACTION-Archetyps deutet darauf hin, dass eine Art von Aktivität tatsächlich stattgefunden hat. In der Regel handelt es sich dabei um eine tatsächliche Erbringung der Dienstleistung, kann jedoch auch einen fehlgeschlagenen Versuch oder eine andere Aktivität wie die Verschiebung der Dienstleistung umfassen. Wenn es eine formelle Anforderung für die Dienstleistung gibt, wird der Status dieser Bestellung durch den Pathway-Schritt repräsentiert, gegen den die Daten aufgezeichnet werden. Zum Beispiel kann der Fortschrittszustand einer Überweisungsanfrage mithilfe dieses Archetyps durch separate Einträge in den Fortschrittsnotizen der EHR bei jedem \"Pathway\"-Schritt erfasst werden:\r\n- Aufzeichnung eines geplanten Startdatums/geplanter Uhrzeit für die Überweisung (Dienstleistung angesetzt), oder\r\n- Aufzeichnung über eine vollständig erbrachte Überweisung, möglicherweise mit zusätzlichen Informationen zur erbrachten Dienstleistung (Dienstleistung abgeschlossen).\r\n\r\nWenn die Aktivitäten den üblichen Geplanten > Angesetzten > Aktiven > Abgeschlossenen Zuständen folgen, ist es in der Regel nicht notwendig, einen \"Grund\" aufzuzeichnen - vielmehr wird er in der Regel verwendet, um den Grund für Abweichungen vom typischen Versorgungspfad zu protokollieren.\r\n\r\nBitte beachten Sie, dass im openEHR-Referenzmodell ein 'Time'-Attribut vorhanden ist, das dazu dient, Datum und Uhrzeit zu erfassen, zu welchem Zeitpunkt jeder Schritt des Pfades der Aktion durchgeführt wurde. Dies ist das Attribut, das verwendet werden sollte, um den Beginn der Prozedur (unter Verwendung des Schritts \"Dienstleistung erbracht\") oder die Zeit zu protokollieren, zu der der Leistung abgebrochen wurde (unter Verwendung des Schritts \"Dienstleistung eingestellt\").",
          "misuse" : "Nicht zur Darstellung von Informationen über durchgeführte Aktivitäten die spezielle Archetypen benötigen, weil sie eine sehr spezifische Datenerfassung oder Anforderungen an Schritte des Pfades haben. Zum Beispiel: ACTION.procedure oder ACTION.health_education.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "sv" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "sv"
          },
          "keywords" : [ ],
          "copyright" : "© openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nb" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nb"
          },
          "purpose" : "For å registrere detaljer om en enkel helserelatert tjeneste eller aktivitet utført av en kliniker, organisasjon eller virksomhet.",
          "keywords" : [ "henvisning", "konsultasjon", "kontakt" ],
          "use" : "Brukes for å registrere detaljer om en enkel helserelatert tjeneste eller aktivitet utført av en kliniker, organisasjon eller virksomhet. Dette omfatter sporing av fremdrift fra planlegging, via tidfesting og utførelse til fullføring, i tillegg til avvik fra det tilsiktede forløpet, for eksempel utsettelse eller avlysning. Dette gjøres ved å registrere informasjon i relevante dataelementer om de spesifikke prosesstrinnene i arketypen.\r\n\r\nDenne arketypen omfatter aktiviteter for et bredt spekter av ukomplekse kliniske tjenester, for eksempel:\r\n- egenhenvisning fra en pasient for kontroll hos tannlege til forebyggende behandling\r\n- en serie konsultasjoner hos en fysioterapeut til behandling av muskel/skjelettbelastning\r\n- en henvisning fra bestillende helsepersonell, for eksempel en fastlege, til mottakende helsepersonell, for eksempel et sykehus, for at pasienten skal motta en bestemt tjeneste, råd eller behandling.\r\n\r\nYtterligere strukturert og detaljert informasjon om tjenesten kan registreres ved å bruke formålsspesifikke arketyper i SLOTet \"Tjenestedetaljer\", der det er nødvendig.\r\n\r\nDenne arketypen kan brukes på to måter:\r\n- som en fullstendig oversikt over tjenesten som ble levert; eller\r\n- som et rammeverk for å registrere tilstanden til den forespurte tjenesten, med separate OBSERVATION-arketyper i samme templat, og som brukes til å registrere de faktiske resultatene av den leverte tjenesten - for eksempel OBSERVATION.hearing_screening_result\r\n\r\nTidspunkter knyttet til en tjeneste kan administreres på en av to måter:\r\n- ved å bruke referansemodellen - tiden for utførelse av ethvert prosesstrinn vil benytte ACTION time referansemodell-attributtet for hvert trinn; eller\r\n- ved bruk av arketypedata - dataelementet \"Tidfestet dato/tid\" er ment å registrere det nøyaktige tidspunktet når tjenesten er planlagt utført. Merk: det tilsvarende ACTION-tidsattributtet for trinnet \"Tjeneste tidfestet\" vil registrere tiden da tjenesten ble planlagt i et system, ikke den tiltenkte dato/klokkeslett som tjenesten er ment å bli utført på.\r\n\r\nI praksis vil enkelte tjenester (for eksempel innen dagbehandling) skje én gang og ikke bestilles og planlagges på forhånd. Detaljene om tjenesten vil bli lagt direkte til i prosesstrinnet, \"Tjeneste fullført\". I andre tilfeller vil en gjentakende tjeneste bli bestilt, og i denne situasjonen vil data knyttet til trinnet '\"Tjeneste utført\" bli registrert ved hver repetisjon av tjenesten, slik at den overordnede helsetjenesteaktiviteten blir værende i aktiv tilstand. Når siste tjeneste er registrert, benyttes prosesstrinnet \"Tjeneste fullført\" som viser at denne bestillingen nå er i fullført tilstand.\r\n\r\nI andre situasjoner, for eksempel andrelinjetjeneste, kan det være en formell bestilling av en tjeneste ved bruk av en tilsvarende INSTRUCTION.service_request-arketype. Denne ACTION-arketypen kan deretter brukes til å registrere arbeidsflyten for når og hvordan bestillingen er utført.\r\n\r\nVed registrering av informasjon ved hjelp av denne arketypen indikeres det at en aktivitet faktisk har skjedd. Dette vil som oftest være tjenesteleveransen i seg selv, kan kan også være et mislykket forsøk eller en utsettelse. Dersom det finnes en formell ordinering av tjenesten, representeres statusen for ordinering ved prosesstrinnet som registreres. For eksempel kan denne arketypen brukes til å følge fremgangen i behandlingen av en henvisning gjennom separate journaloppføringer, hver med sitt prosesstrinn:\r\n- registrere dato/tiden tjenesten er ment utført på ved hjelp av elementet \"Planlagt dato/id\" og prosesstrinnet \"Tjeneste tidfestet\"\r\n- registrere at henvisningen er fullført, potensielt inkludert informasjon om den leverte tjenesten, og prosesstrinnet \"Tjeneste fullført\"\r\n\r\nDersom aktivitetene følger den vanlige flyten Planlagt > Tidfestet > Aktiv > Fullført, er det som regel ikke nødvendig å registrere en \"Årsak\". Elementet \"Årsak\" er ment brukt for å angi hvorfor et forløp avviker fra den typiske flyten.\r\n\r\nVær oppmerksom på at i openEHR referansemodellen er det et \"Time\"-attributt, som er ment å registrere når hvert prosesstrinn i tjenesteaktiviteten ble utført. Dette er attributtet som skal brukes til å registrere starttidspunktet for tjenesteutføringen (ved å bruke prosesstrinnet 'Tjeneste utført') eller tidspunktet da tjenesten ble avbrutt (ved å bruke prosesstrinnet 'Tjeneste avbrutt').",
          "misuse" : "Skal ikke brukes til å registrere data om utførte aktiviteter som krever en spesialbygd ACTION-arketype fordi de har svært spesifikke data eller krav til prosesstrinn. For eksempel: ACTION.procedure eller ACTION.health_education.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "pt-br" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "pt-br"
          },
          "purpose" : "*To record details about a health-related service or activity delivered by a clinician, organisation or agency. This includes tracking progress from planning, via scheduling and delivery to completion, as well as deviations from the intended care path such as postponement or cancellation. (en)",
          "keywords" : [ "referência", "visita", "encontro" ],
          "use" : "*To record details about a health-related service or activity delivered by a clinician, organisation or agency. This includes tracking progress from planning, via scheduling and delivery to completion, as well as deviations from the intended care path such as postponement or cancellation. This is achieved by the recording of relevant data elements about specific activities, each of which are described as the 'Pathway' careflow steps in this archetype.\r\n\r\nThe scope of this archetype deliberately encompasses activities for a broad range of clinical services, to act as a non-specific archetype for all use cases. Examples include, but are not limited to:\r\n- self-referral by a patient for a check-up visit to a dentist for preventive care\r\n- a series of visits to a physiotherapist for management of a musculoskeletal strain; and\r\n- a referral from a requesting healthcare provider, such as a primary care clinician, to a receiving healthcare provider, such as a specialist, for the patient to receive a specific service, advice or care.\r\n\r\nAdditional structured and detailed information about the service can be captured using purpose-specific archetypes inserted into the 'Service detail' slot, where required.\r\n\r\nThis archetype may only be used in two ways:\r\n- as a full record of the service that was delivered; or\r\n- as a framework to record primarily the state of the requested service, with separate OBSERVATION archetypes used to record the actual test results for the delivered service - for example OBSERVATION.hearing_screening_result.\r\n\r\nTimings related to service management can be managed in one of two ways:\r\n- Using the reference model - the time for performance of any pathway step will use the ACTION time attribute for each step.\r\n- Archetyped data elements - the 'Scheduled date/time' data element is intended to record the time when the service was intended to be carried out. Note: the corresponding ACTION time attribute for the Scheduled pathway step will record the time that the clinical activity was scheduled into a system, not the intended date/time on which the activity is intended to be carried out.\r\n\r\nIn practice, some services (for example, in ambulatory care) will occur once and not be ordered in advance. The details about the service will be added against the pathway step, 'Service completed'. In some cases a recurring service will be ordered, and in this situation data against the 'Service delivered' step will be recorded on each occasion, leaving the instruction in the active state. When the last delivery of the service is recorded, the 'Service completed' action is recorded showing that this order is now in the completed state.\r\n\r\nIn other situations, such as secondary care, there may be a formal order for a service using a corresponding INSTRUCTION.request archetype. This ACTION archetype can then be used to record the workflow of when and how the order has been carried out.\r\n\r\nRecording information using this ACTION archetype indicates that some sort of activity has actually occurred; this will usually be the service delivery itself but may be a failed attempt or another activity such as postponement of the service delivery. If there is a formal order for the service, the state of this order is represented by the Pathway step against which the data is recorded. For example, using this archetype the progressing state of a referral request may be recorded through separate entries in the EHR progress notes at each 'Pathway' step:\r\n- record the scheduled Start date/time for the referral (Service scheduled); and\r\n- record that the referral has been completed, potentially including information about the service delivered (Service completed).\r\n\r\nWhen the activities follow the usual Planned > Scheduled > Active > Completed states, recording a 'Reason' is not usually necessary - rather, it is usually used to record the reason for deviation from the typical care pathway.\r\n\r\nPlease note that in the openEHR Reference Model there is a 'Time' attribute, which is intended to record the date and time at which each pathway step of the Action was performed. This is the attribute to use to record the start of the service (using the 'Service delivered' pathway step) or the time that the service was aborted (using the 'Service abandoned' pathway step). (en)",
          "misuse" : "Não deve ser usado para registrar dados sobre atividades realizadas para atividades que exigem um arquétipo ACTION construído para esse fim, pois elas possuem requisitos muito específicos de registro de dados ou de etapas do caminho. Por exemplo: ACTION.procedure ou ACTION.health_education.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "en" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "en"
          },
          "purpose" : "To record details about a simple health-related service or activity delivered by a clinician, organisation or agency.",
          "keywords" : [ "referral", "visit", "encounter" ],
          "use" : "To record details about a simple health-related service or activity delivered by a clinician, organisation or agency. This includes tracking progress from planning, via scheduling and delivery to completion, as well as deviations from the intended care path such as postponement or cancellation. This is achieved by the recording of relevant data elements about specific activities, each of which are described as the 'Pathway' careflow steps in this archetype.\r\n\r\nThe scope of this archetype deliberately encompasses activities for a broad range of clinical services, to act as a non-specific archetype for all non-complex use cases. Examples include, but are not limited to:\r\n- self-referral by a patient for a check-up visit to a dentist for preventive care\r\n- a series of visits to a physiotherapist for management of a musculoskeletal strain; and\r\n- a referral from a requesting healthcare provider, such as a primary care clinician, to a receiving healthcare provider, such as a specialist, for the patient to receive a specific service, advice or care.\r\n\r\nAdditional structured and detailed information about the service can be captured using purpose-specific archetypes inserted into the 'Service detail' slot, where required.\r\n\r\nThis archetype may only be used in two ways:\r\n- as a full record of the service that was delivered; or\r\n- as a framework to record primarily the state of the requested service, with separate OBSERVATION archetypes used to record the actual test results for the delivered service - for example OBSERVATION.hearing_screening_result.\r\n\r\nTimings related to service management can be managed in one of two ways:\r\n- Using the reference model - the time for performance of any pathway step will use the ACTION time attribute for each step.\r\n- Archetyped data elements - the 'Scheduled date/time' data element is intended to record the time when the service was intended to be carried out. Note: the corresponding ACTION time attribute for the Scheduled pathway step will record the time that the clinical activity was scheduled into a system, not the intended date/time on which the activity is intended to be carried out.\r\n\r\nIn practice, some services (for example, in ambulatory care) will occur once and not be ordered in advance. The details about the service will be added against the pathway step, 'Service completed'. In some cases a recurring service will be ordered, and in this situation data against the 'Service delivered' step will be recorded on each occasion, leaving the instruction in the active state. When the last delivery of the service is recorded, the 'Service completed' action is recorded showing that this order is now in the completed state.\r\n\r\nIn other situations, such as secondary care, there may be a formal order for a service using a corresponding INSTRUCTION.request archetype. This ACTION archetype can then be used to record the workflow of when and how the order has been carried out.\r\n\r\nRecording information using this ACTION archetype indicates that some sort of activity has actually occurred; this will usually be the service delivery itself but may be a failed attempt or another activity such as postponement of the service delivery. If there is a formal order for the service, the state of this order is represented by the Pathway step against which the data is recorded. For example, using this archetype the progressing state of a referral request may be recorded through separate entries in the EHR progress notes at each 'Pathway' step:\r\n- record the scheduled Start date/time for the referral (Service scheduled); and\r\n- record that the referral has been completed, potentially including information about the service delivered (Service completed).\r\n\r\nWhen the activities follow the usual Planned > Scheduled > Active > Completed states, recording a 'Reason' is not usually necessary - rather, it is usually used to record the reason for deviation from the typical care pathway.\r\n\r\nPlease note that in the openEHR Reference Model there is a 'Time' attribute, which is intended to record the date and time at which each pathway step of the Action was performed. This is the attribute to use to record the start of the service (using the 'Service delivered' pathway step) or the time that the service was aborted (using the 'Service abandoned' pathway step).",
          "misuse" : "Not to be used to record data about activities carried out for activities that require a purpose built ACTION archetype because they have very specific data recording or pathway step requirements. For example: ACTION.procedure or ACTION.health_education.",
          "copyright" : "© openEHR Foundation, Northern Territory Department of Health (Australia)",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nl" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nl"
          },
          "purpose" : "Om gegevens vast te leggen over een eenvoudige gezondheidsgerelateerde dienst of activiteit geleverd door een arts, organisatie of instantie.",
          "keywords" : [ "verwijzing", "bezoek" ],
          "use" : "Om gegevens vast te leggen over een eenvoudige gezondheidsgerelateerde dienst of activiteit geleverd door een arts, organisatie of instantie. Dit omvat het bijhouden van de voortgang van planning, via het maken van afspraken en levering tot voltooiing, evenals afwijkingen van het geplande zorgpad zoals uitstel of annulering. Dit wordt bereikt door het vastleggen van relevante gegevenselementen over specifieke activiteiten, die in dit archetype elk worden beschreven als de zorgstroomstappen 'Pathway'.\r\n\r\nDe reikwijdte van dit archetype omvat bewust activiteiten voor een breed scala aan klinische diensten, om te fungeren als een niet-specifiek archetype voor alle niet-complexe use cases. Voorbeelden zijn onder andere\r\n- zelfverwijzing door een patiënt voor een controlebezoek aan een tandarts voor preventieve zorg\r\n- een reeks bezoeken aan een fysiotherapeut voor de behandeling van een overbelasting van het bewegingsapparaat; en\r\n- een verwijzing van een aanvragende zorgverlener, zoals een huisarts, naar een ontvangende zorgverlener, zoals een specialist, om de patiënt een specifieke dienst, advies of zorg te laten ontvangen.\r\n\r\nAanvullende gestructureerde en gedetailleerde informatie over de dienst kan worden vastgelegd met behulp van doel-specifieke archetypes die waar nodig worden ingevoegd in de sleuf \"Dienstinformatie\".\r\n\r\nDit archetype mag slechts op twee manieren worden gebruikt:\r\n- als een volledig verslag van de geleverde dienst; of\r\n- als een kader om voornamelijk de status van de gevraagde dienst vast te leggen, met afzonderlijke OBSERVATION-archetypes die gebruikt worden om de eigenlijke testresultaten voor de geleverde dienst vast te leggen - bijvoorbeeld OBSERVATION.hearing_screening_result.\r\n\r\nTimings met betrekking tot servicebeheer kunnen op twee manieren worden beheerd:\r\n- Met behulp van het referentiemodel - de tijd voor de uitvoering van elke padstap zal het ACTION tijd-attribuut voor elke stap gebruiken.\r\n- Archetypische gegevenselementen - het gegevenselement \"Geplande datum/tijd\" is bedoeld om het tijdstip vast te leggen waarop de dienst uitgevoerd zou worden. Opmerking: het overeenkomstige ACTION tijd-attribuut voor de stap Geplande route registreert het tijdstip waarop de klinische activiteit in een systeem werd gepland, niet de beoogde datum/tijd waarop de activiteit zou worden uitgevoerd.\r\n\r\nIn de praktijk zullen sommige diensten (bijvoorbeeld in de ambulante zorg) eenmalig plaatsvinden en niet vooraf besteld worden. De gegevens over de dienst worden toegevoegd aan de stap 'Dienst voltooid'. In sommige gevallen wordt een terugkerende dienst besteld, en in deze situatie worden de gegevens voor de stap \"Geleverde dienst\" bij elke gelegenheid geregistreerd, waardoor de instructie in de actieve status blijft. Wanneer de laatste levering van de dienst wordt geregistreerd, wordt de actie 'Dienst voltooid' geregistreerd, wat aangeeft dat deze opdracht nu in de status 'voltooid' staat.\r\n\r\nIn andere situaties, zoals secundaire zorg, kan er een formele opdracht zijn voor een dienst met behulp van een overeenkomstig INSTRUCTION.request archetype. Dit ACTION archetype kan dan worden gebruikt om de workflow vast te leggen van wanneer en hoe de opdracht is uitgevoerd.\r\n\r\nHet vastleggen van informatie met behulp van dit ACTION archetype geeft aan dat een of andere activiteit daadwerkelijk heeft plaatsgevonden; dit zal meestal de dienstlevering zelf zijn, maar het kan ook een mislukte poging zijn of een andere activiteit zoals uitstel van de dienstlevering. Als er een formele order is voor de dienst, wordt de status van deze order weergegeven door de Pathway stap waartegen de gegevens worden geregistreerd. Bij gebruik van dit archetype kan de voortgang van een verwijzingsverzoek bijvoorbeeld worden vastgelegd door middel van afzonderlijke vermeldingen in de voortgangsnotities van het EPD bij elke stap van het pad:\r\n- de geplande begindatum/tijd voor de verwijzing vastleggen (dienst gepland); en\r\n- vastleggen dat de verwijzing voltooid is, eventueel met informatie over de geleverde dienst (dienst voltooid).\r\n\r\nAls de activiteiten de gebruikelijke Gepland > Afspraak gemaakt > Actief > Voltooid toestanden volgen, is het vastleggen van een 'Reden' meestal niet nodig - het wordt eerder gebruikt om de reden voor afwijking van het typische zorgpad vast te leggen.\r\n\r\nLet op dat er in het openEHR Referentiemodel een attribuut 'Tijd' is, dat bedoeld is om de datum en tijd vast te leggen waarop elke stap in het zorgpad van de Actie werd uitgevoerd. Dit is het te gebruiken attribuut voor het vastleggen van de start van de dienst (bij gebruik van de stap 'Geleverde dienst') of de tijd dat de dienst werd afgebroken (bij gebruik van de stap 'Dienst afgebroken').",
          "misuse" : "Niet te gebruiken om gegevens vast te leggen over uitgevoerde activiteiten voor activiteiten waarvoor een speciaal gebouwd ACTION-archetype nodig is omdat zij zeer specifieke vereisten inzake gegevensregistratie of trajectstappen hebben. Bijvoorbeeld: ACTION.procedure of ACTION.health_education.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        }
      }
    },
    "parentArchetypeId" : "openEHR-EHR-ACTION.service.v1",
    "differential" : true,
    "archetypeId" : {
      "@type" : "ARCHETYPE_HRID",
      "value" : "openEHR-EHR-ACTION.ovl-service-001.v1"
    },
    "definition" : {
      "@type" : "C_COMPLEX_OBJECT",
      "rmTypeName" : "ACTION",
      "nodeId" : "at0000.1",
      "attributes" : [ {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "ism_transition",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0002.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "526" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0002" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0035.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "526" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0035" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0008.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "527" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0008" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0009.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "528" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0009" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0003.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "529" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0003" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0004.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "245" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0004" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0010.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "530" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0010" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0006.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "531" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0006" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0023.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "533" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0023" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ISM_TRANSITION",
          "occurrences" : "0..0",
          "nodeId" : "at0005.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "current_state",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "openehr"
                  },
                  "constraint" : [ "532" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          }, {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "careflow_step",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_CODED_TEXT",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "defining_code",
                "children" : [ {
                  "@type" : "C_TERMINOLOGY_CODE",
                  "rmTypeName" : "CODE_PHRASE",
                  "occurrences" : "1..1",
                  "terminologyId" : {
                    "value" : "local"
                  },
                  "constraint" : [ "at0005" ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      }, {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "description",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ITEM_TREE",
          "nodeId" : "at0001",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "items",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0013.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0032.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_DATE_TIME",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_INTERVAL<DV_DATE_TIME>",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_DURATION",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_INTERVAL<DV_DURATION>",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_TEXT",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0025.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0021.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_COUNT",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "magnitude",
                    "children" : [ {
                      "@type" : "C_INTEGER",
                      "rmTypeName" : "INTEGER",
                      "occurrences" : "1..1",
                      "constraint" : [ {
                        "lower" : 1,
                        "lowerIncluded" : true,
                        "upperIncluded" : false,
                        "lowerUnbounded" : false,
                        "upperUnbounded" : true
                      } ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0012.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0028.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      }, {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "protocol",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ITEM_TREE",
          "nodeId" : "at0015",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "items",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "nodeId" : "at0016.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_IDENTIFIER",
                  "defaultValue" : {
                    "@type" : "DV_IDENTIFIER"
                  },
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "nodeId" : "at0018.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_IDENTIFIER",
                  "defaultValue" : {
                    "@type" : "DV_IDENTIFIER"
                  },
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      } ],
      "attributeTuples" : [ ]
    },
    "terminology" : {
      "@type" : "ARCHETYPE_TERMINOLOGY",
      "conceptCode" : "at0000",
      "termDefinitions" : {
        "en" : { },
        "pt-br" : { },
        "de" : { },
        "nb" : { },
        "nl" : { },
        "sv" : { }
      },
      "termBindings" : { },
      "terminologyExtracts" : { },
      "valueSets" : { }
    },
    "adlVersion" : "1.4",
    "buildUid" : "f596dd3a-2cba-4dec-9d40-ecfefe33b142",
    "rmName" : "openehr",
    "rmRelease" : "1.1.0",
    "generated" : true,
    "otherMetaData" : { },
    "originalLanguage" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "en"
    },
    "translations" : [ {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "de"
      },
      "author" : {
        "name" : "Eva-Maria Rieß, Natalia Strauch",
        "organisation" : "Universitätsmedizin Göttingen, Medizinische Hochschule Hannover",
        "email" : "eva-maria.riess@med.uni-goettingen.de, Strauch.Natalia@mh-hannover.de"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nb"
      },
      "author" : {
        "name" : "Silje Ljosland Bakke, John Tore Valand, Terje Sagmyr",
        "organisation" : "Helse Vest IKT AS",
        "email" : "silje.ljosland.bakke@helse-vest-ikt.no, john.tore.valand@helse-vest-ikt.no, terje.sagmyr@helse-vest-ikt.no"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "pt-br"
      },
      "author" : {
        "name" : "Ana Paula Pannuti, Débora Farage, Adriana Kitajima, Fernanda Maia e Clóvis Puttini.",
        "organisation" : "Core Consulting",
        "email" : "ana.andrade@coreconsulting.com.br"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nl"
      },
      "author" : {
        "name" : "Mattijs Kuhlmann",
        "organisation" : "Nedap",
        "email" : "mattijs.kuhlmann@nedap.com"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "sv"
      },
      "author" : { },
      "otherDetails" : { }
    } ]
  }, {
    "@type" : "TEMPLATE_OVERLAY",
    "uid" : "25786dd4-bcd8-4fa9-8bf7-73a60a1edb77",
    "description" : {
      "@type" : "RESOURCE_DESCRIPTION",
      "originalAuthor" : { },
      "otherContributors" : [ ],
      "ipAcknowledgements" : { },
      "references" : { },
      "conversionDetails" : { },
      "otherDetails" : {
        "PARENT:MD5-CAM-1.0.1" : "6175B5DE04E6302E3DEB0C8EB876BE34"
      },
      "details" : {
        "de" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "de"
          },
          "purpose" : "Allgemeines Konzept für eine gesundheitsbezogene Dienstleistung oder Aktivität, die von einem Kliniker, einer Abteilung oder einer Einrichtung erbracht werden soll.",
          "keywords" : [ "Anfrage", "Bestellung", "Dienst", "Bereitstellung", "Empfehlung", "Überweisung" ],
          "use" : "Zur Darstellung einer Anforderung für eine gesundheitsbezogene Dienstleistung oder Aktivität, die von einem Kliniker, einer Abteilung oder einer Einrichtung erbracht werden soll.\r\n\r\nDieser Archetyp wurde als ein Konzept entworfen, das als Grundlage für die Entwicklung eines solchen Modells dienen kann:\r\n- eine Anforderung einer gesundheitsbezogenen Dienstleistung von einem Kliniker, einer Abteilung oder einer Einrichtung an einen anderen Kliniker, eine andere Abteilung oder eine andere Einrichtung . Zum Beispiel: eine Überweisung an einen spezialisierten Kliniker für eine Behandlung oder eine zweite klinische Meinung; die Verlegung der Versorgung in eine Notaufnahme; die stündliche Überwachung von vier Vitalparametern; und die Bereitstellung von Dienstleistungen zu Hause durch einen Gemeinderat; oder\r\n- einen Antrag auf eine Nachsorgeleistung, die für denselben Kliniker, dieselbe Abteilung oder Einrichtung geplant werden soll. Zum Beispiel: ein Nachsorgetermin bei ambulanten Patienten in 6 Wochen. \r\n\r\nKlinische Anwendungsfälle:\r\n- Betrachten Sie eine Anweisung eines Klinikers für eine Nachsorgetermin in 6 Wochen. \"Nachsorgetermin\" wird der \"Name der Dienstleistung\" sein. Wenn sie '6 Wochen' als vorgeschlagenen Zeitpunkt für den Termin in die Benutzerschnittstelle eingeben, wird das klinische System das Datum in sechs Wochen ab heute im Datenelement \"Dienstleistung erforderlich\" aufzeichnen.\r\n- Betrachten Sie eine Anweisung eines Klinikers der eine Diabetesaufklärung als \"Name der Dienstleistung\" anfordert. Die Werte für \"Grund für die Anforderung\" können \"Neue Diagnose\" und \"Verhinderung von Ketoazidose\" sein. Die 'Klinische Indikation' wird 'Diabetes Typ 1' sein, die mit der Diagnose und/oder dem Laborergebnis verknüpft sein kann. Wenn ein 4-wöchiger Kurs erforderlich ist, bei dem die Sitzungen in wöchentlichen Abständen zu 4 verschiedenen Anlässen organisiert werden, dann erfordert die komplexe Zeitplanung die Verwendung des Archetyps CLUSTER.service_direction und des zugehörigen CLUSTER.timing_nondaily.\r\n- Betrachten Sie eine Anweisung eines Klinikers, der einen wiederkehrenden Bluttest, z.B. einen INR-Test, anfordert. die komplexe Zeitplanung hierfür erfordert die Verwendung der CLUSTER.service_direction und des zugehörigen Archetyp CLUSTER.timing_nondaily, um jedes Timing in einer Abfolge von Tests zu definieren, z.B. \"täglich für eine Woche, wöchentlich für 4 Wochen, monatlich für 6 Monate\".\r\n\r\nDie Standardvorgabe für diesen Archetyp ist, dass es sich um eine Anforderung für einen einzelnen Dienst handelt. Wenn eine Reihe von Diensten erforderlich ist, verwenden Sie den Archetyp CLUSTER.service_direction innerhalb des \"Komplexe Zeitplanung\" SLOT.\r\n\r\nIn vielen Situationen wird es möglich sein, die Schritte darzustellen, die als Teil dieser Anforderung auftreten, die unter Verwendung des entsprechenden generischen ACTION.service ausgeführt wird. Es wird jedoch viele Gelegenheiten geben, bei denen der erforderliche ACTION-Archetyp für den Zweck sehr spezifisch sein wird, da die Anforderungen an die Daten für die Aufzeichnung der Bereitstellung vieler gesundheitsbezogener Dienste ziemlich einzigartige Datenelemente, Aufzeichnung von Mustern oder Pathway-Schritten erfordern. Zum Beispiel: ACTION.screening oder ACTION.health_education.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "sv" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "sv"
          },
          "purpose" : "Generiskt ramverk för begäran om en hälsorelaterad tjänst eller aktivitet som ska levereras av en kliniker eller organisation.",
          "keywords" : [ "remiss", "förfrågan", "beställning", "tjänst", "tillhandahålla", "patientremittering" ],
          "use" : "Generiskt ramverk för begäran om en hälsorelaterad tjänst eller aktivitet som ska levereras av en kliniker, organisation eller myndighet. \r\n\r\nDenna arketyp har utformats som ett ramverk och kan användas som grund för:\r\n- en begäran från en kliniker eller organisation eller myndighet till en annan kliniker, organisation eller myndighet om en hälsorelaterad tjänst. Till exempel: en hänvisning till en specialistkliniker för behandling eller ett andra kliniskt yttrande; överföring av vård till en akutavdelning; fyra timmars övervakning av vitala tecken; och tillhandahållande av hemtjänster från kommunen; eller\r\n- en begäran om att en uppföljningstjänst ska planeras för samma läkare, organisation eller myndighet. Till exempel: ett uppföljande besök i öppenvården om 6 veckor.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nb" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nb"
          },
          "purpose" : "Generisk forespørsel om utførelse av en helsetjeneste, til annet helsepersonell eller andre organisasjoner.",
          "keywords" : [ "rekvisisjon", "bestilling", "foreskriving", "tjeneste", "tjenesteyter", "rekvirere", "bestille", "anmodning", "forespørre", "forespørsel", "anmode", "tilsyn" ],
          "use" : "Brukes til å registrere en forespørsel om en helserelatert tjeneste eller aktivitet som skal utføres av en kliniker, organisasjon eller virksomhet.\r\n\r\nArketypen er designer som et rammeverk som kan brukes som grunnlag for:\r\n- En forespørsel om en helserelatert tjeneste, fra en kliniker eller organisasjon til en annen kliniker eller organisasjon. For eksempel: En henvisning til en spesialist for behandling eller second opinion, ansvarsoverføring til akuttmottaket, monitorering av vitale tegn hver 4. time, eller hjemmesykepleie fra kommunen.\r\n- En forespørsel om oppfølging fra samme kliniker eller organisasjon, for eksempel kontroll på poliklinikk om 6 uker.\r\n\r\nKliniske brukseksempler:\r\n- Dersom en kliniker setter opp en kontrolltime om 6 uker: \"Tjenestenavn\" settes til \"Kontroll\". Dersom klinikeren skriver inn \"6 uker\" som tid for kontrolltime i brukergrensesnittet, vil det kliniske systemet registrere datoen 6 uker etter registreringsdatoen i elementet \"Dato/tid forfall\".\r\n- Dersom en kliniker setter opp en pasient til \"undervisning om diabetes\" i \"Tjenestenavn\". Verdiene for \"Årsak for forespørsel\" kan være \"Ny diagnose\" og \"Forebygging av ketoacidose\". \"Klinisk indikasjon\" kan være \"Diabetes type 1\", som kan lenkes til en Problem/diagnose og/eller et Laboratorieprøveresultat. Dersom det er nødvendig med et kurs på 4 uker, med 4 ukentlige undervisningsøkter, må en bruke arketypene CLUSTER.service_direction og CLUSTER.timing_nondaily for å registrere kompleks timinginformasjon.\r\n- Dersom en kliniker ordinerer en gjentagende blodprøve, som for eksempel INR: Den komplekse timingen for dette krever bruk av arketypene CLUSTER.service_direction og CLUSTER.timing_nondaily for å definere hver timing i en sekvens, for eksempel \"daglig i en uke, ukentlig i 4 uker, månedlig i 6 måneder\".\r\n\r\nEn grunnleggende antagelse for denne arketypen er at den er en forespørsel for én enkelt helsetjeneste. Dersom man trenger en gjentagende tjeneste, kan dette spesifiseres ved å bruke arketypen CLUSTER.service_direction i SLOTet \"Kompleks timing\".\r\n\r\nI mange situasjoner vil det være mulig å registrere stegene som gjennomgås i utførelsen av forespørselen ved hjelp av den generiske arketypen ACTION.service. Imidlertid vil det være mange tilfeller der det vil være behov for en spesifikk ACTION-arketype, for å kunne oppfylle behov om spesifikke dataelementer, registreringsmønstre eller prosesstrinn. Eksempler på dette er ACTION.screening og ACTION.health_education.",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "pt-br" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "pt-br"
          },
          "purpose" : "Estrutura de solicitação genérica para um serviço ou atividade relacionada à saúde a ser prestado por um médico, organização ou agência.",
          "keywords" : [ "solicitação", "requisição", "ordem", "pedido", "serviço", "referência", "encaminhamento" ],
          "use" : "Use para registrar uma solicitação de um serviço ou atividade relacionada à saúde a ser prestado por um médico, organização ou agência.\r\n\r\nEste arquétipo foi projetado como uma estrutura que pode ser usada como base para:\r\n- uma solicitação de um clínico, organização ou agência a outro clínico, organização ou agência para um serviço relacionado à saúde. Por exemplo: uma referência a um clínico especialista para tratamento ou uma segunda opinião clínica; transferência do atendimento para um pronto-socorro; monitoramento de sinais vitais de quatro horas; e prestação de serviços domiciliares de um conselho municipal; ou\r\n- uma solicitação de um serviço de acompanhamento a ser agendado para o mesmo médico, organização ou agência. Por exemplo: uma consulta de revisão de pacientes ambulatoriais em 6 semanas.\r\n\r\nCasos-de-uso clínicos:\r\n- Considere um médico solicitando uma consulta de acompanhamento em 6 semanas. 'Consulta de acompanhamento' será o 'Nome do serviço'. Se eles inserirem '6 semanas' como o tempo proposto para a consulta na interface do usuário, o sistema clínico registrará a data seis semanas a partir de hoje no elemento de dados 'Serviço devido'.\r\n- considere um médico solicitando Educação sobre Diabetes como o 'Nome do serviço'. Os valores para 'Motivo da solicitação' podem ser 'Novo diagnóstico' e 'Prevenção de cetoacidose'. A 'indicação clínica' será 'Diabetes tipo 1', que pode estar associada ao diagnóstico de problemas e / ou resultados de exames laboratoriais. Se um curso de 4 semanas for necessário, com sessões organizadas em intervalos semanais em 4 ocasiões diferentes, o tempo complexo requer o uso de CLUSTER.service_direction e o arquétipo CLUSTER.timing_nondaily associado.\r\n- Considere um médico solicitando um exame de sangue recorrente, como um INR. O tempo complexo para isso requer o uso de CLUSTER.service_direction e o arquétipo CLUSTER.timing_nondaily associado para definir cada tempo de uma sequência de testes, como 'diariamente por uma semana, semanalmente por 4 semanas, mensalmente por 6 meses'.\r\n\r\nA suposição padrão para esse arquétipo é que ele é uma solicitação de um único serviço. Se uma série de serviços for necessária, use o arquétipo CLUSTER.service_direction dentro do SLOT 'Complex timing'.\r\n\r\nEm muitas situações, será possível registrar as etapas que ocorrem como parte dessa solicitação que está sendo realizada usando o ACTION.service genérico correspondente. No entanto, haverá muitas ocasiões em que o arquétipo de AÇÃO exigido será muito específico para o propósito, uma vez que os requisitos de dados para registrar o fornecimento de muitos serviços relacionados à saúde precisarão de elementos de dados bastante exclusivos, padrões de registro ou etapas do caminho. Por exemplo: ACTION.screening ou ACTION.health_education.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "en" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "en"
          },
          "purpose" : "Generic request framework for a health-related service or activity to be delivered by a clinician, organisation or agency.",
          "keywords" : [ "request", "order", "service", "provide", "referral" ],
          "use" : "Use to record a request for a health-related service or activity to be delivered by a clinician, organisation or agency.\r\n\r\nThis archetype has been designed as a framework that can be used as the basis for:\r\n- a request from one clinician, organisation or agency to another clinician, organisation or agency for a health-related service. For example: a referral to a specialist clinician for treatment or a second clinical opinion; transfer of care to an emergency department; four hourly vital signs monitoring; and provision of home services from a municipal council; or\r\n- a request for a follow up service to be scheduled for the same clinician, organisation or agency. For example: a review appointment in outpatients in 6 weeks. \r\n\r\nClinical use cases:\r\n- consider a clinician ordering a follow-up appointment in 6 weeks. 'Follow-up appointment' will be the 'Service name'. If they enter '6 weeks' as the proposed timing for the appointment in the User Interface, the clinical system will record the date six weeks from today in the 'Service due' data element.\r\n- consider a clinician ordering Diabetes Education as the 'Service name'. The values for 'Reason for request' may be 'New diagnosis' and 'Prevention of ketoacidosis'. The 'Clinical indication' will be 'Diabetes Type 1', which may be linked to the Problem Diagnosis and/or Laboratory test results. If a 4 week course is required, with sessions organised at weekly intervals on 4 separate occasions, then the complex timing requires use of the CLUSTER.service_direction and associated CLUSTER.timing_nondaily archetype.\r\n- consider a clinician ordering a recurring blood test, such as an INR. The complex timing for this requires use of the CLUSTER.service_direction and associated CLUSTER.timing_nondaily archetype to define each timing in a sequence of tests, such as 'daily for one week, weekly for 4 weeks, monthly for 6 months'.\r\n\r\nThe default assumption for this archetype is that it's a request for a single service. If a series of services are required, use the CLUSTER.service_direction archetype within the 'Complex timing' SLOT.\r\n\r\nIn many situations it will be possible to record the steps that occur as part of this request being carried out using the corresponding generic ACTION.service. However, there will be many occasions where the required ACTION archetype will be very specific for purpose, as the data requirements for recording provision of many health-related services will need quite unique data elements, recording patterns or pathway steps. For example: ACTION.screening or ACTION.health_education.",
          "copyright" : "© openEHR Foundation, Nasjonal IKT HF",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "it" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "it"
          },
          "purpose" : "Quadro generico di richiesta per un servizio o un'attività sanitaria che deve essere fornita da un medico, da un'organizzazione o da un'agenzia.",
          "keywords" : [ "richiesta, ordine, servizio, fornire, indirizzamento" ],
          "use" : "Usato per registrare la richiesta di un servizio o di un'attività sanitaria da parte di un clinico, di un'organizzazione o di un'agenzia.\r\n\r\nQuesto archetipo è stato progettato come una cornice che possa essere utilizzata come base per:\r\n- una richiesta da un clinico, organizzazione o agenzia ad un altro clinico, organizzazione o agenzia per un servizio sanitario. Per esempio: la richiesta di un medico specialista per un trattamento o un secondo parere clinico; il trasferimento delle cure a un reparto di emergenza; il monitoraggio dei segni vitali ogni quattro ore; e la fornitura di servizi a domicilio da parte di un consiglio comunale; oppure\r\n- una richiesta di un servizio di follow-up da programmare per lo stesso clinico, organizzazione o agenzia. Ad esempio: un appuntamento di controllo in ambulatorio in 6 settimane. \r\n\r\nCasi d'uso clinico:\r\n- si prenda in considerazione l'idea di un clinico che ordini un appuntamento di follow-up tra 6 settimane. L'\"Appuntamento di follow-up\" sarà il \"Nome del servizio\". Se si inseriscono '6 settimane' come tempistica proposta per l'appuntamento nell'interfaccia utente, il sistema clinico registrerà la data a sei settimane da oggi nell'elemento \"Tempistica per la fornitura del servizio\".\r\n- si consideri un clinico che ordina l'educazione al diabete come 'Nome del servizio'. I valori per 'Motivo della richiesta' possono essere 'Nuova diagnosi' e 'Prevenzione della chetoacidosi'. L'\"Indicazione clinica\" sarà \"Diabete di tipo 1\", che può essere collegato all'archetipo Problem Diagnosis e/o a Laboratory test results. Se è richiesto un corso di 4 settimane, con sessioni organizzate a intervalli settimanali in 4 occasioni separate, allora la complessa tempistica richiede l'uso dell'archetipo CLUSTER.service_direction e dell'associato CLUSTER.timing_nondaily.\r\n- si prenda in considerazione un medico che ordina un esame del sangue ricorrente, come ad esempio un INR. La complessa tempistica per questo richiede l'uso del CLUSTER.service_direction e dell'archetipo CLUSTER.timing_nondaily associato per definire ogni tempistica in una sequenza di test, come ad esempio \"giornalmente per una settimana, settimanalmente per 4 settimane, mensilmente per 6 mesi\".\r\n\r\nIl presupposto di default per questo archetipo è che si tratti di una richiesta per un singolo servizio. Se è richiesta una serie di servizi, utilizzare l'archetipo CLUSTER.service_direction all'interno dello SLOT 'Tempistica Complessa'.\r\n\r\nIn molte situazioni sarà possibile registrare i passaggi che si verificano nell'ambito di questa richiesta che viene effettuata utilizzando il corrispondente generico ACTION.service. Tuttavia, ci saranno molte occasioni in cui l'archetipo di ACTION richiesto sarà molto specifico per lo scopo, in quanto i requisiti di dati per la registrazione della fornitura di molti servizi sanitari avranno bisogno di elementi, pattern di registrazione o fasi di percorso piuttosto unici. Ad esempio: ACTION.screening o ACTION. health_education.\r\n\r\n\r\n\r\n",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nl" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nl"
          },
          "purpose" : "Generiek verzoekkader voor een gezondheidsgerelateerde dienst of activiteit die moet worden geleverd door een zorgverlener, organisatie of instantie.",
          "keywords" : [ "verzoek", "opdracht", "dienst", "voorschrift", "verwijzing" ],
          "use" : "Gebruik dit om een verzoek vast te leggen voor een gezondheidsgerelateerde dienst of activiteit die moet worden geleverd door een arts, organisatie of instantie.\r\n\r\nDit archetype is ontworpen als een raamwerk dat als basis kan dienen voor:\r\n- een verzoek van de ene arts, organisatie of instantie aan een andere arts, organisatie of instantie voor een gezondheidsgerelateerde dienst. Bijvoorbeeld: een verwijzing naar een specialistisch arts voor behandeling of een second clinical opinion; overdracht van zorg naar een afdeling spoedeisende hulp; vier uur durende monitoring van vitale functies; en dienstverlening aan huis door een gemeente; of\r\n- een verzoek om een vervolgservice in te plannen voor dezelfde arts, organisatie of instantie. Bijvoorbeeld: een controleafspraak bij poliklinische patiënten over 6 weken.\r\n\r\nKlinische gebruiksgevallen:\r\n- neem bijvoorbeeld een arts die opdracht geeft tot een vervolgafspraak voor over 6 weken. De 'Servicenaam' wordt 'Vervolgafspraak'. Als ze '6 weken' invoeren als de voorgestelde timing voor de afspraak in de gebruikersinterface, zal het klinische systeem de datum zes weken vanaf vandaag vastleggen in het gegevenselement 'Servicetijd'.\r\n- In het geval van een clinicus die Diabetes Education gebruikt als de 'Servicenaam'. De waarden bij 'Reden verzoek' kunnen 'Nieuwe diagnose' en 'Preventie van ketoacidose' zijn. De 'Klinische indicatie' wordt 'Diabetes Type 1', mogelijk gekoppeld aan de Probleemdiagnose en/of Laboratoriumuitslagen. Als een cursus van 4 weken vereist is, met sessies die wekelijks op 4 verschillende gelegenheden worden georganiseerd, dan vereist de complexe timing het gebruik van het CLUSTER.service_direction en het bijbehorende CLUSTER.timing_nondaily archetype.\r\n- beeld je in dat een arts om een ​​terugkerend bloedonderzoek vraagt, zoals een INR. De complexe timing hiervoor vereist het gebruik van het CLUSTER.service_direction en het bijbehorende archetype CLUSTER.timing_nondaily om elke timing in een reeks tests te definiëren, zoals 'dagelijks gedurende een week, wekelijks gedurende 4 weken, maandelijks gedurende 6 maanden'.\r\n\r\nDe standaardaanname voor dit archetype is dat het om een enkele service gaat. Als een reeks services vereist is, gebruikt u het archetype CLUSTER.service_direction binnen het SLOT 'Complex timing'.\r\n\r\nIn veel situaties zal het mogelijk zijn om de stappen die plaatsvinden als onderdeel van dit verzoek dat wordt uitgevoerd, vast te leggen met behulp van de bijbehorende generieke ACTION.service. Er zullen zich echter veel gelegenheden voordoen waarin het vereiste ACTIE-archetype zeer specifiek zal zijn voor het doel, aangezien de gegevensvereisten voor het vastleggen van de levering van veel gezondheidsgerelateerde diensten vrij unieke gegevenselementen, registratiepatronen of trajectstappen vereisen. Bijvoorbeeld: ACTION.screening of ACTION.health_education.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        }
      }
    },
    "parentArchetypeId" : "openEHR-EHR-INSTRUCTION.service_request.v1",
    "differential" : true,
    "archetypeId" : {
      "@type" : "ARCHETYPE_HRID",
      "value" : "openEHR-EHR-INSTRUCTION.ovl-service_request-001.v1"
    },
    "definition" : {
      "@type" : "C_COMPLEX_OBJECT",
      "rmTypeName" : "INSTRUCTION",
      "nodeId" : "at0000.1",
      "attributes" : [ {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "activities",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ACTIVITY",
          "nodeId" : "at0001",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "description",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ITEM_TREE",
              "nodeId" : "at0009",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "items",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "nodeId" : "at0121.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_TEXT",
                      "defaultValue" : {
                        "value" : "Molekylärpatologi genutredning",
                        "@type" : "DV_TEXT"
                      },
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_STRING",
                          "rmTypeName" : "STRING",
                          "constraint" : [ "Molekylärpatologi genutredning" ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "nodeId" : "at0148.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_TEXT",
                      "defaultValue" : {
                        "value" : "Klinisk molekylärpatologi",
                        "@type" : "DV_TEXT"
                      },
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_STRING",
                          "rmTypeName" : "STRING",
                          "constraint" : [ "Klinisk molekylärpatologi" ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0135.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0153.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0062.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0064.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0152.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0065.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0068.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_CODED_TEXT",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "defining_code",
                        "children" : [ {
                          "@type" : "C_TERMINOLOGY_CODE",
                          "rmTypeName" : "TERMINOLOGY_CODE",
                          "occurrences" : "1..1",
                          "terminologyId" : {
                            "value" : "local"
                          },
                          "constraint" : [ "ac0.1" ],
                          "selectedTerminologies" : [ ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_TEXT",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0040.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_DATE_TIME",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_INTERVAL<DV_DATE_TIME>",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    }, {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_TEXT",
                      "attributes" : [ ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0145.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0144.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0147.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_BOOLEAN",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_BOOLEAN",
                          "rmTypeName" : "BOOLEAN",
                          "occurrences" : "1..1",
                          "constraint" : [ true ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0076.1",
                  "attributes" : [ {
                    "@type" : "C_ATTRIBUTE",
                    "rmAttributeName" : "value",
                    "children" : [ {
                      "@type" : "C_COMPLEX_OBJECT",
                      "rmTypeName" : "DV_BOOLEAN",
                      "attributes" : [ {
                        "@type" : "C_ATTRIBUTE",
                        "rmAttributeName" : "value",
                        "children" : [ {
                          "@type" : "C_BOOLEAN",
                          "rmTypeName" : "BOOLEAN",
                          "occurrences" : "1..1",
                          "constraint" : [ true ]
                        } ]
                      } ],
                      "attributeTuples" : [ ]
                    } ]
                  } ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0078.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "ELEMENT",
                  "occurrences" : "0..0",
                  "nodeId" : "at0150.1",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      }, {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "protocol",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ITEM_TREE",
          "nodeId" : "at0008",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "items",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "nodeId" : "at0010.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_TEXT",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_IDENTIFIER",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0011.1",
              "attributes" : [ {
                "@type" : "C_ATTRIBUTE",
                "rmAttributeName" : "value",
                "children" : [ {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_TEXT",
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                }, {
                  "@type" : "C_COMPLEX_OBJECT",
                  "rmTypeName" : "DV_IDENTIFIER",
                  "defaultValue" : {
                    "@type" : "DV_IDENTIFIER"
                  },
                  "attributes" : [ ],
                  "attributeTuples" : [ ]
                } ]
              } ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "ELEMENT",
              "occurrences" : "0..0",
              "nodeId" : "at0127.1",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_ARCHETYPE_ROOT",
              "rmTypeName" : "CLUSTER",
              "occurrences" : "0..1",
              "nodeId" : "at0141.1",
              "attributes" : [ ],
              "attributeTuples" : [ ],
              "archetypeRef" : "openEHR-EHR-CLUSTER.ovl-organisation-001.v1",
              "referenceType" : "archetypeOverlay"
            }, {
              "@type" : "C_ARCHETYPE_ROOT",
              "rmTypeName" : "CLUSTER",
              "occurrences" : "0..1",
              "nodeId" : "at0142.1",
              "attributes" : [ ],
              "attributeTuples" : [ ],
              "archetypeRef" : "openEHR-EHR-CLUSTER.ovl-organisation-002.v1",
              "referenceType" : "archetypeOverlay"
            } ]
          } ],
          "attributeTuples" : [ ]
        } ]
      } ],
      "attributeTuples" : [ ]
    },
    "terminology" : {
      "@type" : "ARCHETYPE_TERMINOLOGY",
      "conceptCode" : "at0000",
      "termDefinitions" : {
        "en" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "(Synthesized)",
            "code" : "ac0.1",
            "description" : ""
          }
        },
        "nb" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          }
        },
        "it" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          }
        },
        "de" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          }
        },
        "sv" : {
          "at0148.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0148.1",
            "text" : "Laboratoriediciplin",
            "description" : "Kategori på typ av efterfrågad tjänst",
            "comment" : "Kodning av \"Typ av tjänst\" är att föredra, om möjligt. Om 'Namn på tjänst' är kodat är det möjligt för detta dataelement att härledas från koden. Exempelvis: biokemi eller mikrobiologi laboratorium, ultraljud eller datatomografi."
          },
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          },
          "at0010.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0010.1",
            "text" : "Remissidentitet",
            "description" : "Den lokala identifieraren som tilldelats av det begärande kliniska systemet.",
            "comment" : "Vanligtvis motsvarande HL7 Placer Order Identifier."
          }
        },
        "pt-br" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          }
        },
        "nl" : {
          "ac0.1" : {
            "@type" : "ARCHETYPE_TERM",
            "text" : "*(Synthesized) (en)",
            "code" : "ac0.1",
            "description" : ""
          }
        }
      },
      "termBindings" : { },
      "terminologyExtracts" : { },
      "valueSets" : {
        "ac0.1" : {
          "@type" : "VALUE_SET",
          "id" : "ac0.1",
          "members" : [ "at0136", "at0137", "at0138" ]
        }
      }
    },
    "adlVersion" : "1.4",
    "buildUid" : "9b5845da-4da6-48ff-acc9-a91a018f60ed",
    "rmName" : "openehr",
    "rmRelease" : "1.1.0",
    "generated" : true,
    "otherMetaData" : { },
    "originalLanguage" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "en"
    },
    "translations" : [ {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "de"
      },
      "author" : {
        "name" : "Alina Rehberg, Natalia Strauch",
        "organisation" : "Medizinische Hochschule Hannover",
        "email" : "rehberg.alina@mh-hannover.de, Strauch.Natalia@mh-hannover.de"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "sv"
      },
      "author" : {
        "name" : "Sofia Janstad",
        "organisation" : "SLL",
        "email" : "sofia.lang-janstad@sll.se"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nb"
      },
      "author" : {
        "name" : "Silje Ljosland Bakke, Marit Alice Venheim",
        "organisation" : "Nasjonal IKT HF, Norway, Helse Vest IKT",
        "email" : "marit.alice.venheim@helse-vest-ikt.no"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "pt-br"
      },
      "author" : {
        "name" : "Vladimir Pizzo",
        "organisation" : "Clínica Parente Pizzo",
        "email" : "vrppizzo@gmail.com"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "it"
      },
      "author" : {
        "name" : "Francesca Frexia",
        "organisation" : "CRS4 - Center for advanced studies, research and development in Sardinia, Pula (Cagliari), Italy",
        "email" : "francesca.frexia@crs4.it"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nl"
      },
      "author" : {
        "name" : "Mattijs Kuhlmann, Joost Holslag",
        "organisation" : "Nedap",
        "email" : "mattijs.kuhlmann@nedap.com, joost.holslag@nedap.com"
      },
      "otherDetails" : { }
    } ]
  }, {
    "@type" : "TEMPLATE_OVERLAY",
    "uid" : "f5450da7-6f8a-463f-8ad5-16de9d5cb78b",
    "description" : {
      "@type" : "RESOURCE_DESCRIPTION",
      "originalAuthor" : { },
      "otherContributors" : [ ],
      "ipAcknowledgements" : { },
      "references" : { },
      "conversionDetails" : { },
      "otherDetails" : {
        "PARENT:MD5-CAM-1.0.1" : "5DFD0809E7CD46EA0712A590C68F545B"
      },
      "details" : {
        "de" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "de"
          },
          "purpose" : "Zur Darstellung von Informationen zur einer Organisation, wie sie bekannt sind oder im Rahmen der klinischen Dokumentation verstanden werden.",
          "keywords" : [ "Organisation, Anbieter, Versorger, Betreuer, Netzwerk, Verbund, Gruppe" ],
          "use" : "Der Archetyp wird verwendet, um Informationen zur einer Organisation darzustellen, wie sie bekannt sind oder im Rahmen der klinischen Dokumentation verstanden werden, oft ad hoc oder wenn die Verwendung von einem formellen demografischen Register oder einem Index nicht angemessen oder nicht möglich ist.\r\nBeispiele beinhalten:\r\n- der Inhaber einer Patientenverfügung unter Verwendung des SLOT „Inhaber der Kopie“ innerhalb des Archetyps EVALUATION.advance_care_directive oder\r\n- Name und Kontaktdaten einer Organisation, die die Betreuung einer Person in ihrem zu Hause übernimmt.\r\n\r\nDieser Archetyp wurde entwickelt, um Angaben zu offiziell anerkannten Einrichtungen, wie einem eingetragenen Unternehmen, einem Krankenhaus und seinen anerkannten „Unterorganisationen“, wie einer operativ getrennten oder spezialisierten Satellitenklinik oder einem häuslichen Pflegedienst, zu enthalten. Es kann auch verwendet werden, um Kontaktinformationen über informellere Netzwerke oder Gruppen darzustellen, wie z. B. eine lokale Selbsthilfegruppe.\r\n\r\nDieser Archetyp könnte auch als Proxy für formale demografische Daten verwendet werden, wenn ein Template mit Domänenexperten überprüft wird – beispielsweise bei einer Bewertung, bei der die Prüfer erwarten würden, dass die Details zu der Organisation oben auf dem Bewertungsformular angezeigt werden.",
          "misuse" : "Der Archetyp darf nicht verwendet werden, um ein offizielles Register oder einen Index darzustellen, zu ersetzen oder zu führen. Verwenden Sie zu diesem Zweck einen formellen Gesundheitsanbieter-Index (Health Provider Index) oder Archetypen, die auf dem openEHR Demographic Information Model basieren.\r\n\r\nDer Archetyp darf nicht verwendet werden, um den Pflegeort und ähnliche Datenelemente darzustellen, die formal in der Patientenakte unter Verwendung der Reference Model-Attribute dargestellt werden sollten.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "sv" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "sv"
          },
          "purpose" : "Att registrera information om en organisation på det sätt som det behöver representeras i en journalanteckning.\r\n",
          "keywords" : [ "organisation, leverantör, vårdgivare, vårdenhet, enhet, avdelning, nätverk, grupp" ],
          "use" : "Används för att registrera information om en organisation som behöver representeras i journalen. Används exempelvis ad hoc eller i de fall då formella demografiska register eller kataloger inte kan användas istället. \r\nExempel inkluderar:\r\n- namn och kontaktuppgifter för en organisation som har en fysisk kopia av patientens önskemål om vård i händelse av att patienten inte längre kan kommunicera\r\n- namn och kontaktuppgifter för hemtjänst- eller hemsjukvårdsorganisation för en individ\r\n\r\nDenna arketyp har utformats för att dokumentera information om formellt erkända enheter, såsom ett registrerat företag, ett sjukhus och dess erkända \"underorganisationer\", såsom en separat eller specialiserad satellitklinik eller hemsjukvård. Den kan också användas för att dokumentera kontaktinformation om mer informella nätverk eller grupper, till exempel en lokal stödgrupp.\r\n\r\nDen här arketypen kan också användas som en proxy för formell demografisk data när man granskar en mall med domänexperter - exempelvis där granskare förväntar sig att se en organisations information i ett formulär.",
          "misuse" : "*Not to be used to represent, replace or maintain an official register or index. Use a formal Health Provider Index for this purpose, or archetypes based on the openEHR Demographic Information Model.\r\n\r\nNot to be used to represent the location of care and similar data elements that should be represented formally in the health record using the Reference Model attributes. (en)",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nb" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nb"
          },
          "purpose" : "For å registrere detaljer om en organisasjon, som man har informasjon om eller har forstått, i det kliniske dokumentasjonsarbeidet.",
          "keywords" : [ "organisasjon, leverandør, omsorgsperson, nettverk, gruppe" ],
          "use" : "Brukes for å registrere detaljer om en organisasjon, som man har informasjon om eller har forstått, i det kliniske dokumentasjonsarbeidet, ofte ad hoc eller i de tilfeller når det ikke er ønskelig eller mulig å bruke et formelt demografisk register eller indeks.\r\n\r\nFor eksempel:\r\n- kopiinnhaver av av et fremtidig behandlingsvalg ved å bruke \"Kopiholder\"-SLOTet i arketypen \"EVALUATION.advance_care_directive\" (Fremtidig behandlingsvalg).\r\n- navn og kontaktdetaljer for en organisasjon som yter hjemmehjelp til en enkeltperson.\r\n\r\nDenne arketypen er utformet for å registrere detaljer om formelt anerkjente enheter, for eksempel en registrert virksomhet, et sykehus og dets \"underorganisasjoner\", en operativt separat eller spesialisert satellittklinikk eller hjemmetjeneste. Den kan også brukes til å registrere kontaktinformasjon om mer uformelle nettverk eller grupper, for eksempel en lokal støttegruppe.\r\n\r\nDenne arketypen kan også brukes som en midlertidig erstatning for formelle demografiske data når man gjennomgår et templat med domeneeksperter - for eksempel en vurdering der man i templatet forventer å se detaljer om en organisasjon i et vurderingsskjema.",
          "misuse" : "Brukes ikke til å representere, erstatte eller vedlikeholde formelle demografiske opplysninger. Bruk et formelt pasientregister, helsepersonellregister eller arketyper basert på openEHR demografisk informasjonsmodell til dette formålet.\r\n\r\nBrukes ikke for å representere behandlingssted eller lignende dataelementer, som skal representeres formelt i pasientjournalen. Bruk attributter fra Referansemodellen for dette formålet.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "en" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "en"
          },
          "purpose" : "To record details about an organisation as they are known or understood in the course of clinical documentation.",
          "keywords" : [ "organisation, organization, provider, carer, network, group" ],
          "use" : "Use to record details of an organisation as they are known or understood in the course of clinical documentation, often ad hoc or when it is not appropriate or possible to use a formal demographic register or index. Examples include:\r\n- the copyholder of an advanced care record, using the 'Copyholder' SLOT within the EVALUATION.advance_care_directive archetype; or\r\n- the name and contact details of an organisation providing home care to an individual.\r\n\r\nThis archetype has been designed to carry details of formally recognised entities, such as a registered business, a hospital and its recognised 'sub-organisations', such as an operationally separate or specialised satellite clinic or home care service. It may also be used to carry contact information about more informal networks or groups, such as a local community support group.\r\n\r\nThis archetype could also be used as a proxy for formal demographic data when reviewing a template with domain experts - for example, an assessment where reviewers would expect to see an organisations' details on an assessment form.",
          "misuse" : "Not to be used to represent, replace or maintain an official register or index. Use a formal Health Provider Index for this purpose, or archetypes based on the openEHR Demographic Information Model.\r\n\r\nNot to be used to represent the location of care and similar data elements that should be represented formally in the health record using the Reference Model attributes.",
          "copyright" : "© openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        }
      }
    },
    "parentArchetypeId" : "openEHR-EHR-CLUSTER.organisation.v1",
    "differential" : true,
    "archetypeId" : {
      "@type" : "ARCHETYPE_HRID",
      "value" : "openEHR-EHR-CLUSTER.ovl-organisation-001.v1"
    },
    "definition" : {
      "@type" : "C_COMPLEX_OBJECT",
      "rmTypeName" : "CLUSTER",
      "nodeId" : "at0000.1",
      "attributes" : [ {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "items",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ELEMENT",
          "nodeId" : "at0001.1",
          "attributes" : [ ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ELEMENT",
          "nodeId" : "at0003.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "value",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_IDENTIFIER",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_TEXT",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ELEMENT",
          "occurrences" : "0..0",
          "nodeId" : "at0004.1",
          "attributes" : [ ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ELEMENT",
          "occurrences" : "0..0",
          "nodeId" : "at0019.1",
          "attributes" : [ ],
          "attributeTuples" : [ ]
        } ]
      } ],
      "attributeTuples" : [ ]
    },
    "terminology" : {
      "@type" : "ARCHETYPE_TERMINOLOGY",
      "conceptCode" : "at0000",
      "termDefinitions" : {
        "en" : { },
        "nb" : { },
        "de" : { },
        "sv" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Remitterande vårdenhet/klinik",
            "description" : "*An entity comprising one or more people and having a particular purpose. (en)",
            "comment" : "*For example: a company, institution, association, network, department, community group, healthcare practice group, payer/insurer, care team, or a group of neighbours who provide care or support. (en)"
          },
          "at0001.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0001.1",
            "text" : "Vårdenhet",
            "description" : "Namnet som en organisation är känd för.",
            "comment" : "Exempelvis: 'Royal Children's Hospital'; 'ABC District Nursing Service'; 'YNWA Oslo' or 'JB Smith Lawyers'."
          },
          "at0003.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0003.1",
            "text" : "Kombika",
            "description" : "Identifierare associerad med den identifierade organisationen.",
            "comment" : "Förekomster (Occurrences) för detta dataelement är satt till 0..* för att tillåta att mer än en identifierare kan användas samtidigt. Observera att ID-datatypen innehåller flera underkomponenter för ID-värde, typ, utfärdare och tilldelare."
          }
        }
      },
      "termBindings" : { },
      "terminologyExtracts" : { },
      "valueSets" : { }
    },
    "adlVersion" : "1.4",
    "buildUid" : "8543bf4b-0e15-4990-8a02-c7d082df8617",
    "rmName" : "openehr",
    "rmRelease" : "1.1.0",
    "generated" : true,
    "otherMetaData" : { },
    "originalLanguage" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "en"
    },
    "translations" : [ {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "de"
      },
      "author" : {
        "name" : "Sarah Ballout, Natalia Strauch",
        "organisation" : "Medizinische Hochschule Hannover",
        "email" : "ballout.sarah@mh-hannover.de, Strauch.Natalia@mh-hannover.de"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "sv"
      },
      "author" : {
        "name" : "Therese Lindberg, Erik Sundvall",
        "organisation" : "Cambio CDS, Karolinska Institutet + Karolinska University Hospital, Region Stockholm + Linköping University",
        "email" : "therese.lindberg@cambio.se, erik.sundvall@regionstockholm.se"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nb"
      },
      "author" : {
        "name" : "Liv Laugen, John Tore Valand, Vebjørn Arntzen, Kanika Kuwelker",
        "organisation" : "​Oslo University Hospital, Norway, Helse Bergen, Helse Vest IKT",
        "email" : "liv.laugen@ous-hf.no, john.tore.valand@helse-bergen.no, john.tore.valand@helse-vest-ikt.no, varntzen@ous-hf.no, kanika.kuwelker@helse-vest-ikt.no"
      },
      "otherDetails" : { }
    } ]
  }, {
    "@type" : "TEMPLATE_OVERLAY",
    "uid" : "aec1820b-056f-4841-a431-dc66837aee4a",
    "description" : {
      "@type" : "RESOURCE_DESCRIPTION",
      "originalAuthor" : { },
      "otherContributors" : [ ],
      "ipAcknowledgements" : { },
      "references" : { },
      "conversionDetails" : { },
      "otherDetails" : {
        "PARENT:MD5-CAM-1.0.1" : "5DFD0809E7CD46EA0712A590C68F545B"
      },
      "details" : {
        "de" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "de"
          },
          "purpose" : "Zur Darstellung von Informationen zur einer Organisation, wie sie bekannt sind oder im Rahmen der klinischen Dokumentation verstanden werden.",
          "keywords" : [ "Organisation, Anbieter, Versorger, Betreuer, Netzwerk, Verbund, Gruppe" ],
          "use" : "Der Archetyp wird verwendet, um Informationen zur einer Organisation darzustellen, wie sie bekannt sind oder im Rahmen der klinischen Dokumentation verstanden werden, oft ad hoc oder wenn die Verwendung von einem formellen demografischen Register oder einem Index nicht angemessen oder nicht möglich ist.\r\nBeispiele beinhalten:\r\n- der Inhaber einer Patientenverfügung unter Verwendung des SLOT „Inhaber der Kopie“ innerhalb des Archetyps EVALUATION.advance_care_directive oder\r\n- Name und Kontaktdaten einer Organisation, die die Betreuung einer Person in ihrem zu Hause übernimmt.\r\n\r\nDieser Archetyp wurde entwickelt, um Angaben zu offiziell anerkannten Einrichtungen, wie einem eingetragenen Unternehmen, einem Krankenhaus und seinen anerkannten „Unterorganisationen“, wie einer operativ getrennten oder spezialisierten Satellitenklinik oder einem häuslichen Pflegedienst, zu enthalten. Es kann auch verwendet werden, um Kontaktinformationen über informellere Netzwerke oder Gruppen darzustellen, wie z. B. eine lokale Selbsthilfegruppe.\r\n\r\nDieser Archetyp könnte auch als Proxy für formale demografische Daten verwendet werden, wenn ein Template mit Domänenexperten überprüft wird – beispielsweise bei einer Bewertung, bei der die Prüfer erwarten würden, dass die Details zu der Organisation oben auf dem Bewertungsformular angezeigt werden.",
          "misuse" : "Der Archetyp darf nicht verwendet werden, um ein offizielles Register oder einen Index darzustellen, zu ersetzen oder zu führen. Verwenden Sie zu diesem Zweck einen formellen Gesundheitsanbieter-Index (Health Provider Index) oder Archetypen, die auf dem openEHR Demographic Information Model basieren.\r\n\r\nDer Archetyp darf nicht verwendet werden, um den Pflegeort und ähnliche Datenelemente darzustellen, die formal in der Patientenakte unter Verwendung der Reference Model-Attribute dargestellt werden sollten.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "sv" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "sv"
          },
          "purpose" : "Att registrera information om en organisation på det sätt som det behöver representeras i en journalanteckning.\r\n",
          "keywords" : [ "organisation, leverantör, vårdgivare, vårdenhet, enhet, avdelning, nätverk, grupp" ],
          "use" : "Används för att registrera information om en organisation som behöver representeras i journalen. Används exempelvis ad hoc eller i de fall då formella demografiska register eller kataloger inte kan användas istället. \r\nExempel inkluderar:\r\n- namn och kontaktuppgifter för en organisation som har en fysisk kopia av patientens önskemål om vård i händelse av att patienten inte längre kan kommunicera\r\n- namn och kontaktuppgifter för hemtjänst- eller hemsjukvårdsorganisation för en individ\r\n\r\nDenna arketyp har utformats för att dokumentera information om formellt erkända enheter, såsom ett registrerat företag, ett sjukhus och dess erkända \"underorganisationer\", såsom en separat eller specialiserad satellitklinik eller hemsjukvård. Den kan också användas för att dokumentera kontaktinformation om mer informella nätverk eller grupper, till exempel en lokal stödgrupp.\r\n\r\nDen här arketypen kan också användas som en proxy för formell demografisk data när man granskar en mall med domänexperter - exempelvis där granskare förväntar sig att se en organisations information i ett formulär.",
          "misuse" : "*Not to be used to represent, replace or maintain an official register or index. Use a formal Health Provider Index for this purpose, or archetypes based on the openEHR Demographic Information Model.\r\n\r\nNot to be used to represent the location of care and similar data elements that should be represented formally in the health record using the Reference Model attributes. (en)",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "nb" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "nb"
          },
          "purpose" : "For å registrere detaljer om en organisasjon, som man har informasjon om eller har forstått, i det kliniske dokumentasjonsarbeidet.",
          "keywords" : [ "organisasjon, leverandør, omsorgsperson, nettverk, gruppe" ],
          "use" : "Brukes for å registrere detaljer om en organisasjon, som man har informasjon om eller har forstått, i det kliniske dokumentasjonsarbeidet, ofte ad hoc eller i de tilfeller når det ikke er ønskelig eller mulig å bruke et formelt demografisk register eller indeks.\r\n\r\nFor eksempel:\r\n- kopiinnhaver av av et fremtidig behandlingsvalg ved å bruke \"Kopiholder\"-SLOTet i arketypen \"EVALUATION.advance_care_directive\" (Fremtidig behandlingsvalg).\r\n- navn og kontaktdetaljer for en organisasjon som yter hjemmehjelp til en enkeltperson.\r\n\r\nDenne arketypen er utformet for å registrere detaljer om formelt anerkjente enheter, for eksempel en registrert virksomhet, et sykehus og dets \"underorganisasjoner\", en operativt separat eller spesialisert satellittklinikk eller hjemmetjeneste. Den kan også brukes til å registrere kontaktinformasjon om mer uformelle nettverk eller grupper, for eksempel en lokal støttegruppe.\r\n\r\nDenne arketypen kan også brukes som en midlertidig erstatning for formelle demografiske data når man gjennomgår et templat med domeneeksperter - for eksempel en vurdering der man i templatet forventer å se detaljer om en organisasjon i et vurderingsskjema.",
          "misuse" : "Brukes ikke til å representere, erstatte eller vedlikeholde formelle demografiske opplysninger. Bruk et formelt pasientregister, helsepersonellregister eller arketyper basert på openEHR demografisk informasjonsmodell til dette formålet.\r\n\r\nBrukes ikke for å representere behandlingssted eller lignende dataelementer, som skal representeres formelt i pasientjournalen. Bruk attributter fra Referansemodellen for dette formålet.",
          "originalResourceUri" : { },
          "otherDetails" : { }
        },
        "en" : {
          "@type" : "RESOURCE_DESCRIPTION_ITEM",
          "language" : {
            "terminologyId" : {
              "value" : "ISO_639-1"
            },
            "codeString" : "en"
          },
          "purpose" : "To record details about an organisation as they are known or understood in the course of clinical documentation.",
          "keywords" : [ "organisation, organization, provider, carer, network, group" ],
          "use" : "Use to record details of an organisation as they are known or understood in the course of clinical documentation, often ad hoc or when it is not appropriate or possible to use a formal demographic register or index. Examples include:\r\n- the copyholder of an advanced care record, using the 'Copyholder' SLOT within the EVALUATION.advance_care_directive archetype; or\r\n- the name and contact details of an organisation providing home care to an individual.\r\n\r\nThis archetype has been designed to carry details of formally recognised entities, such as a registered business, a hospital and its recognised 'sub-organisations', such as an operationally separate or specialised satellite clinic or home care service. It may also be used to carry contact information about more informal networks or groups, such as a local community support group.\r\n\r\nThis archetype could also be used as a proxy for formal demographic data when reviewing a template with domain experts - for example, an assessment where reviewers would expect to see an organisations' details on an assessment form.",
          "misuse" : "Not to be used to represent, replace or maintain an official register or index. Use a formal Health Provider Index for this purpose, or archetypes based on the openEHR Demographic Information Model.\r\n\r\nNot to be used to represent the location of care and similar data elements that should be represented formally in the health record using the Reference Model attributes.",
          "copyright" : "© openEHR Foundation",
          "originalResourceUri" : { },
          "otherDetails" : { }
        }
      }
    },
    "parentArchetypeId" : "openEHR-EHR-CLUSTER.organisation.v1",
    "differential" : true,
    "archetypeId" : {
      "@type" : "ARCHETYPE_HRID",
      "value" : "openEHR-EHR-CLUSTER.ovl-organisation-002.v1"
    },
    "definition" : {
      "@type" : "C_COMPLEX_OBJECT",
      "rmTypeName" : "CLUSTER",
      "nodeId" : "at0000.1",
      "attributes" : [ {
        "@type" : "C_ATTRIBUTE",
        "rmAttributeName" : "items",
        "children" : [ {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ELEMENT",
          "nodeId" : "at0001.1",
          "attributes" : [ ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ELEMENT",
          "nodeId" : "at0003.1",
          "attributes" : [ {
            "@type" : "C_ATTRIBUTE",
            "rmAttributeName" : "value",
            "children" : [ {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_IDENTIFIER",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            }, {
              "@type" : "C_COMPLEX_OBJECT",
              "rmTypeName" : "DV_TEXT",
              "attributes" : [ ],
              "attributeTuples" : [ ]
            } ]
          } ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ELEMENT",
          "occurrences" : "0..0",
          "nodeId" : "at0004.1",
          "attributes" : [ ],
          "attributeTuples" : [ ]
        }, {
          "@type" : "C_COMPLEX_OBJECT",
          "rmTypeName" : "ELEMENT",
          "occurrences" : "0..0",
          "nodeId" : "at0019.1",
          "attributes" : [ ],
          "attributeTuples" : [ ]
        } ]
      } ],
      "attributeTuples" : [ ]
    },
    "terminology" : {
      "@type" : "ARCHETYPE_TERMINOLOGY",
      "conceptCode" : "at0000",
      "termDefinitions" : {
        "en" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Organisation (2)",
            "description" : "An entity comprising one or more people and having a particular purpose.",
            "comment" : "For example: a company, institution, association, network, department, community group, healthcare practice group, payer/insurer, care team, or a group of neighbours who provide care or support."
          }
        },
        "nb" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Organisasjon (2)",
            "description" : "En entitet som består av ett eller flere mennesker med et bestemt formål.",
            "comment" : "For eksempel: Et firma, institusjon, selskap, forening, nettverk, avdeling, gruppe i nærmiljøet, forsikringsselskap, behandlingsteam eller en gruppe av naboer som opptrer som støtte."
          }
        },
        "de" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Organisation (2)",
            "description" : "Eine Einheit, die aus einer oder mehreren Personen besteht und ein bestimmtes Ziel hat.",
            "comment" : "Zum Beispiel: ein Unternehmen, eine Institution, ein Verband, ein Netzwerk, eine Abteilung, eine Gemeindegruppe, eine Gesundheitspraxisgruppe, ein Kostenträger/Versicherer, ein Pflegeteam oder eine Gruppe von Nachbarn, die Pflege oder Unterstützung leisten."
          }
        },
        "sv" : {
          "at0000.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0000.1",
            "text" : "Mottagande laboratorium",
            "description" : "*An entity comprising one or more people and having a particular purpose. (en)",
            "comment" : "*For example: a company, institution, association, network, department, community group, healthcare practice group, payer/insurer, care team, or a group of neighbours who provide care or support. (en)"
          },
          "at0001.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0001.1",
            "text" : "Laboratorieenhet",
            "description" : "Namnet som en organisation är känd för.",
            "comment" : "Exempelvis: 'Royal Children's Hospital'; 'ABC District Nursing Service'; 'YNWA Oslo' or 'JB Smith Lawyers'."
          },
          "at0003.1" : {
            "@type" : "ARCHETYPE_TERM",
            "code" : "at0003.1",
            "text" : "Kombika",
            "description" : "Identifierare associerad med den identifierade organisationen.",
            "comment" : "Förekomster (Occurrences) för detta dataelement är satt till 0..* för att tillåta att mer än en identifierare kan användas samtidigt. Observera att ID-datatypen innehåller flera underkomponenter för ID-värde, typ, utfärdare och tilldelare."
          }
        }
      },
      "termBindings" : { },
      "terminologyExtracts" : { },
      "valueSets" : { }
    },
    "adlVersion" : "1.4",
    "buildUid" : "8543bf4b-0e15-4990-8a02-c7d082df8617",
    "rmName" : "openehr",
    "rmRelease" : "1.1.0",
    "generated" : true,
    "otherMetaData" : { },
    "originalLanguage" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "en"
    },
    "translations" : [ {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "de"
      },
      "author" : {
        "name" : "Sarah Ballout, Natalia Strauch",
        "organisation" : "Medizinische Hochschule Hannover",
        "email" : "ballout.sarah@mh-hannover.de, Strauch.Natalia@mh-hannover.de"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "sv"
      },
      "author" : {
        "name" : "Therese Lindberg, Erik Sundvall",
        "organisation" : "Cambio CDS, Karolinska Institutet + Karolinska University Hospital, Region Stockholm + Linköping University",
        "email" : "therese.lindberg@cambio.se, erik.sundvall@regionstockholm.se"
      },
      "otherDetails" : { }
    }, {
      "@type" : "TRANSLATION_DETAILS",
      "language" : {
        "terminologyId" : {
          "value" : "ISO_639-1"
        },
        "codeString" : "nb"
      },
      "author" : {
        "name" : "Liv Laugen, John Tore Valand, Vebjørn Arntzen, Kanika Kuwelker",
        "organisation" : "​Oslo University Hospital, Norway, Helse Bergen, Helse Vest IKT",
        "email" : "liv.laugen@ous-hf.no, john.tore.valand@helse-bergen.no, john.tore.valand@helse-vest-ikt.no, varntzen@ous-hf.no, kanika.kuwelker@helse-vest-ikt.no"
      },
      "otherDetails" : { }
    } ]
  } ],
  "originalLanguage" : {
    "terminologyId" : {
      "value" : "ISO_639-1"
    },
    "codeString" : "en"
  },
  "translations" : [ {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "de"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "sv"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "nb"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "ar-sy"
    },
    "author" : { },
    "otherDetails" : { }
  }, {
    "@type" : "TRANSLATION_DETAILS",
    "language" : {
      "terminologyId" : {
        "value" : "ISO_639-1"
      },
      "codeString" : "nl"
    },
    "author" : { },
    "otherDetails" : { }
  } ]
}